---
kind: type
id: T:Autodesk.Revit.DB.Analysis.EnergyModelType
source: html/18bdee57-3fa2-b6cd-0dea-24ff66a5f97e.htm
---
# Autodesk.Revit.DB.Analysis.EnergyModelType

This enum is used to define if the energy model is based on rooms/spaces, building elements or analysis mode in EnergyDataSettings.

## Syntax (C#)
```csharp
public enum EnergyModelType
```